let arr = [1,2,3,4,5,6,7] , k = 7;
// [7,1,2,3,4,5,6]
// [6,7,1,2,3,4,5]
// [5,6,7,1,2,3,4]

// 模计算



function Rshfit(list,k){
    // 时间复杂度O(n)
    // 空间复杂度O(n)
    const copy = [...list];//
    const n = list.lenght;
    if(k % n ===0) return
    for(let i = 0;i < n;i++){
        list[i] = copy[[k + i] % n] //左移
        //[4,2,3,4,5,6,7] 第一遍  
        // [4,5,3,4,5,6,7] 第二遍
        // [4,5,6,4,5,6,7] 第三遍
        // [4,5,6,7,5,6,7] 第四遍
        // [4,5,6,7,1,6,7] 第五遍
        // [4,5,6,7,1,2,7] 第六遍
        // [4,5,6,7,1,2,3] 第七遍
    }
    return list;
}

console.log(Rshfit(arr,1));